Autodesk.Revit.DB.FilledRegionType.IsValidLineWeight(System.Int32)
Indicates whether the given line weight value is valid.
lineWeight:
The line weight.
Returns:
True if it is a valid line weight value, false otherwise.
Since:
2013

Autodesk.Revit.DB.FilledRegionType.BackgroundPatternColor
The background fill pattern color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FilledRegionType.ForegroundPatternColor
The foreground fill pattern color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FilledRegionType.Color
The color of the fill pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegionType.LineWeight
The line weight of the fill pattern.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: lineWeight is not a valid line weight value (it must be within the range of 1-16).
Since:
2013

Autodesk.Revit.DB.FilledRegionType.IsMasking
If true then the FilledRegion will cover the lines and edges of objects behind it.
If false then lines and edges will remain visible.
Since:
2019

Autodesk.Revit.DB.FilledRegionType.Background
The background.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.FilledRegionType.BackgroundPatternId
The background fill pattern Id.
Remarks:
The FillPattern used for a background pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FilledRegionType.ForegroundPatternId
The foreground fill pattern Id.
Remarks:
When the FilledRegionAttributes element is in a family then
the FillPattern used for a foreground pattern must have a 'Drafting' target.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FilledRegionType.FillPatternId
The fill pattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The element id must represent a valid FillPatternElement.
-or-
When setting this property: The FillPattern target must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.FilledRegionType
A filled region attributes element.
Note, the forground pattern color is stored in the parent class
Since:
2013